app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hiking"], ["description", "Hiking through the south"], ["user_id", 3], ["created_at", 2016-11-03 16:16:47 UTC], ["updated_at", 2016-11-03 16:16:47 UTC]]
---
  def create
    # might or might not need to call set_user
    set_user
    album = Album.create(
      title: album_params[:title],
      description: album_params[:description],
      user_id: @user.id
    )

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Sky Diving"], ["updated_at", 2016-11-03 16:47:43 UTC], ["id", 4]]
---
  def update
    album = Album.find(params[:id])

    if album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]
---
  def destroy
    album = Album.destroy(params[:id])