app/controllers/comments_controller.rb

  def index
    comments = Photo.find(params[:photo_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 2]]