app/controllers/comments_controller.rb

  def create
    comment = Comment.create(
      body: comment_params[:body],
      photo_id: @photo.id,
      username: @user.username,
      user_id: @user.id
    )
---
INSERT INTO "comments" ("body", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Wow, cool photo!"], ["photo_id", 2], ["created_at", 2016-11-03 19:38:10 UTC], ["updated_at", 2016-11-03 19:38:10 UTC]]

  def destroy
    set_photo
    comment = Comment.destroy(params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]

    def set_photo
      @photo = Photo.find(params[:photo_id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]