app/controllers/photos_controller.rb

  def index
    render json: Album.find(params[:album_id]).photos
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 1]]

  def create
    puts photo_params[:title]
    puts photo_params[:image]
    album = Album.find(1)
    photo = Photo.new(photo_params)
    album.photos << photo
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("title", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "NiN Concert"], ["album_id", 1], ["created_at", 2016-11-03 19:19:07 UTC], ["updated_at", 2016-11-03 19:19:07 UTC]]

  def show
    photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def destroy
    photo = Photo.destroy(params[:id])
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 3]]