app/controllers/users_controller.rb

  def index
    # in the case we want a user or non user search
    # another user to look at their albums and photos
    render json: {status: 200, users: User.all}
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "aaron"], ["created_at", 2016-11-03 02:51:12 UTC], ["updated_at", 2016-11-03 02:51:12 UTC], ["password_digest", "$2a$10$CeVaWt39a4UHM/nlNWlZo.fGqNxgXGLYpMx4j8ePUvHDjphw2fPcq"]]

  def show
    # we want only the users information so we will send
    # it to the front end
    # if we want to show all the users albums we can set user.albums
    # when it arrives on the front end
    # or do a promise request to ping the albums#index which will return
    # the albums based on the users id like users.album
    user = User.find(params[:id])
    albums = User.find(params[:id]).albums
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = $1  [["user_id", 3]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "surname" = $2, "age" = $3, "location" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", "Aaron"], ["surname", "Ballard"], ["age", 34], ["location", "Santiago, Chile"], ["updated_at", 2016-11-03 14:34:41 UTC], ["id", 1]]

  def destroy
    User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]